src/2025-04-16-ac-library-hs-3.org
#+TITLE: =ac-library-hs= の =Extra= モジュールを作成しました
#+DATE: <2025-04-16 Wed>
#+FILETAGS: :atcoder:haskell:

* 背景

[[https://atcoder.jp/][AtCoder]] は隔年でジャッジ環境を更新しています。なんと更新時は *ユーザの提案を丸ごと受け入れています* から、使いたい言語やライブラリがあれば (節度を持った範囲で) 入れ放題です。いつもありがとうございます！

[[https://atcoder.jp/posts/1342][今回の言語アップデート]] に備えて作成した [[https://hackage.haskell.org/package/ac-library-hs][=ac-library-hs=]] に、 =Extra= モジュールを追加しました。もうじき来るであろう新ジャッジのテストに先立って、簡単に中身を紹介します。

* =Extra= モジュールの主な内容

=Extra= に収録したモジュールは、概ね [[https://maspypy.github.io/library/][maspy さんのライブラリ]] の一部の Haskell 移植版です。金冠プレイヤー (上位 100 名の 1 人) のコードを移植したわけですから、かなり強力なモジュールもあります。かいつまんで紹介して行くので、なんだか面白そうだと感じてもらえると幸いです。


** =Bisect=

| 出番   | ★ ★ ★ ★ ☆ |
| 強力さ | ★ ★ ☆ ☆ ☆ |

これは僕が生み出した二分探索モジュールで、例外的に出来が悪いです。 C++ の二分探索 ([[https://cpprefjp.github.io/reference/algorithm/lower_bound.html][=lower_bound=]] 等) を移植したつもりで、妙な API を作ってしまいました。バージョン 1.3 で修正すると思います。

** =Dyn*SegTree*=

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ★ |

動的セグメント木 (必要な部分だけ作るセグメント木) のモジュールです。通常のセグメント木と比べてメモリ使用量が増え、トップダウンの畳み込みをするため効率が落ちますが、座標圧縮が必要無いなど利便性が高めです。

| モジュール       | ノード数 (概算) | 区間取得 | 区間作用 | ノードの初期値 |
|------------------+-----------------+----------+----------+----------------|
| =DynLazySegTree=   | \(4q \log_2 L\) | o        | o        | 任意の値       |
| =DynSegTree=       | \(2q \log_2 L\) | o        | -        | 任意の値       |
| =DynSparseSegTree= | \(q\)           | o        | -        | 単位元のみ可能 |

区間リセットや、セグメント木の部分木を別のセグメント木の部分木に差し替えるなど、変態的な操作が可能です。 =Persistent= 版はメモリ使用量が倍になる代わりに、永続データ構造のように操作履歴を残すことができます。使い道はよく分からないのですが (!?) 強力です。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Graph.html][=Graph=]]

| 出番   | ★ ★ ★ ★ ☆ |
| 強力さ | ★ ★ ★ ☆ ☆ |

グラフ探索のモジュールです。辞書順最小トポロジカルソート、強連結成分分解、二部グラフの着色、 block-cut tree の取得、最短経路探索 (BFS, 01-BFS, Dijkstra, Bellman–Ford, Floyd–Warshall) および経路復元を収録しています。

最短経路探索では n 次元頂点を後述の [[https://hackage.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Ix0.html][=Ix0=]] で抽象化しているため、グリッドにも適用できます。この辺りの趣味が僕と合わないと、単にごちゃごちゃしたモジュールになります。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-HashMap.html][=HashMap=]]

| 出番   | ★ ★ ☆ ☆ ☆ |
| 強力さ | ★ ★ ☆ ☆ ☆ |

[[https://en.wikipedia.org/wiki/Open_addressing][Open addressing method]] の mutable hash map です。 Haskell では [[https://hackage.haskell.org/package/containers][=containers=]] パッケージの永続データ型のマップを使うことが多いのですが、時として深刻な速度不足に陥ります。 この mutable な =HashMap= はほぼ配列並み (平均 \(O(1)\)) のスピードで動作しますから、コンテストでは心強いです。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntMap.html][=IntMap=]]

| 出番   | ★ ★ ★ ★ ★ |
| 強力さ | ★ ★ ★ ☆ ☆ |

=Int= をキーとするマップです。後述の =IntSet= のキー毎に値を関連付けたもので、やはり高速で心強いです。 Mutable データ構造が使いやすい場合にも光ります。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntSet.html][=IntSet=]]

| 出番   | ★ ★ ★ ★ ★ |
| 強力さ | ★ ★ ★ ☆ ☆ |

64 分木による整数集合です。 [[https://docs.rs/hibitset/latest/hibitset/][=hibitset=]] みたいなやつと言うか、 64 等分した区間毎に 1 bit の有無を表す bit 列を \(\lceil \log_{64} n \rceil\) 層持っています。おかげで [[https://judge.yosupo.jp/problem/predecessor_problem][Predecessor Problem]] (1 次元の nearest neighbor problem) が定数倍の良い \(O(\log n)\) で解けて重宝します。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntervalMap.html][=IntervalMap=]]

| 出番   | ★ ★ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ☆ |

これは概ね [[https://noimi.hatenablog.com/entry/2021/05/02/195143][区間を管理する構造体]] の写経モジュールです。区間の追加・削除を追跡しつつ、区間代入と区間削除の操作ができます。 \(q\) 回操作したとき、挿入・削除される区間の数の合計はたかだか \(5q\) 個 (のはず) ですから、区間長を \(n\) として \(O(q \log n)\) でクエリ処理ができます。

これを持っているだけで解ける問題もあります。いずれ緑 diff の典型データ構造に収束しそうです。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Ix0.html][=Ix0=]]

| 出番   | ★ ★ ★ ☆ ☆ |
| 強力さ | ☆ ☆ ☆ ☆ ☆ |

これは =Graph= モジュールのために作った n 次元添字と添字の定義域の抽象です。 Haskell 標準の [[https://hackage.haskell.org/package/base-4.21.0.0/docs/Data-Ix.html][=Data.Ix=]] は閉区間を前提とするため、わざわざ半開区間・ゼロベースの型クラスを用意したわけですが、賛否両論ありそうです。

