2025-04-16-ac-library-hs-3.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ac-library-hs の Extra モジュールを作成しました - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1><code>ac-library-hs</code> の <code>Extra</code> モジュールを作成しました</h1>
      <p>Apr 16, 2025</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="背景"><a href="#背景">背景</a></h2>
      <p>
        <a href="https://atcoder.jp/">AtCoder</a>
        は隔年でジャッジ環境を更新しています。なんと更新時は
        <strong>ユーザの提案を丸ごと受け入れています</strong> から、使いたい言語やライブラリがあれば
        (節度を持った範囲で) 入れ放題です。いつもありがとうございます！<br />
      </p>

      <p>
        <a href="https://atcoder.jp/posts/1342">今回の言語アップデート</a> に備えて作成した
        <a href="https://hackage.haskell.org/package/ac-library-hs"><code>ac-library-hs</code></a>
        に、
        <code>Extra</code>
        モジュールを追加しました。もうじき来るであろう新ジャッジのテストに先立って、簡単に中身を紹介します。<br />
      </p>
      <h2 id="Extra モジュールの主な内容">
        <a href="#Extra モジュールの主な内容"><code>Extra</code> モジュールの主な内容</a>
      </h2>
      <p>
        <code>Extra</code> に収録したモジュールは、概ね
        <a href="https://maspypy.github.io/library/">maspy さんのライブラリ</a> の一部の Haskell
        移植版です。金冠プレイヤー (上位 100 名の 1 人)
        のコードを移植したわけですから、かなり強力なモジュールもあります。かいつまんで紹介して行くので、なんだか面白そうだと感じてもらえると幸いです。<br />
      </p>
      <h3 id="Bisect">
        <a href="#Bisect"><code>Bisect</code></a>
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        これは僕が生み出した二分探索モジュールで、例外的に出来が悪いです。 C++ の二分探索 (<a
          href="https://cpprefjp.github.io/reference/algorithm/lower_bound.html"
          ><code>lower_bound</code></a
        >
        等) を移植したつもりで、妙な API を作ってしまいました。バージョン 1.3
        で修正すると思います。<br />
      </p>
      <h3 id="Dyn*SegTree*">
        <a href="#Dyn*SegTree*"><code>Dyn*SegTree*</code></a>
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ★</td>
          </tr>
        </tbody>
      </table>

      <p>
        動的セグメント木 (必要な部分だけ作るセグメント木)
        のモジュールです。通常のセグメント木と比べてメモリ使用量が増え、トップダウンの畳み込みをするため効率が落ちますが、座標圧縮が必要無いなど利便性が高めです。<br />
      </p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">モジュール</th>
            <th scope="col" class="org-left">ノード数 (概算)</th>
            <th scope="col" class="org-left">区間取得</th>
            <th scope="col" class="org-left">区間作用</th>
            <th scope="col" class="org-left">ノードの初期値</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left"><code>DynLazySegTree</code></td>
            <td class="org-left">\(4q \log_2 L\)</td>
            <td class="org-left">o</td>
            <td class="org-left">o</td>
            <td class="org-left">任意の値</td>
          </tr>

          <tr>
            <td class="org-left"><code>DynSegTree</code></td>
            <td class="org-left">\(2q \log_2 L\)</td>
            <td class="org-left">o</td>
            <td class="org-left">-</td>
            <td class="org-left">任意の値</td>
          </tr>

          <tr>
            <td class="org-left"><code>DynSparseSegTree</code></td>
            <td class="org-left">\(q\log_2 L\)</td>
            <td class="org-left">o</td>
            <td class="org-left">-</td>
            <td class="org-left">単位元のみ可能</td>
          </tr>
        </tbody>
      </table>

      <p>
        区間リセットや、セグメント木の部分木を別のセグメント木の部分木に差し替えるなど、変態的な操作が可能です。
        <code>Persistent</code>
        版はメモリ使用量が倍になる代わりに、永続データ構造のように操作履歴を残すことができます。使い道はよく分からないのですが
        (!?) 強力です。<br />
      </p>
      <h3 id="Graph">
        <a href="#Graph"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Graph.html"
            ><code>Graph</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        グラフ探索のモジュールです。辞書順最小トポロジカルソート、強連結成分分解、二部グラフの着色、
        block-cut tree の取得、最短経路探索 (BFS, 01-BFS, Dijkstra, Bellman–Ford, Floyd–Warshall)
        および経路復元を収録しています。<br />
      </p>

      <p>
        最短経路探索では n 次元頂点を後述の
        <a href="https://hackage.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Ix0.html"
          ><code>Ix0</code></a
        >
        で抽象化しているため、グリッドにも適用できます。この辺りの趣味が僕と合わないと、単にごちゃごちゃしたモジュールになります。<br />
      </p>
      <h3 id="HashMap">
        <a href="#HashMap"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-HashMap.html"
            ><code>HashMap</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        <a href="https://en.wikipedia.org/wiki/Open_addressing">Open addressing method</a> の
        mutable hash map です。 Haskell では
        <a href="https://hackage.haskell.org/package/containers"><code>containers</code></a>
        パッケージの永続データ型のマップを使うことが多いのですが、時として深刻な速度不足に陥ります。
        この mutable な <code>HashMap</code> はほぼ配列並み (平均 \(O(1)\))
        のスピードで動作しますから、コンテストでは心強いです。<br />
      </p>
      <h3 id="IntMap">
        <a href="#IntMap"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntMap.html"
            ><code>IntMap</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ★ ★</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        <code>Int</code> をキーとするマップです。後述の
        <code>IntSet</code> のキー毎に値を関連付けたもので、やはり高速で心強いです。 Mutable
        データ構造が使いやすい場合にも光ります。<br />
      </p>
      <h3 id="IntSet">
        <a href="#IntSet"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntSet.html"
            ><code>IntSet</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ★ ★</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        64 分木による整数集合です。
        <a href="https://docs.rs/hibitset/latest/hibitset/"><code>hibitset</code></a>
        みたいなやつと言うか、 64 等分した区間毎に 1 bit の有無を表す bit 列を \(\lceil \log_{64} n
        \rceil\) 層持っています。おかげで
        <a href="https://judge.yosupo.jp/problem/predecessor_problem">Predecessor Problem</a> (1
        次元の nearest neighbor problem) が定数倍の良い \(O(\log n)\) で解けて重宝します。<br />
      </p>
      <h3 id="IntervalMap">
        <a href="#IntervalMap"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-IntervalMap.html"
            ><code>IntervalMap</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        これは概ね
        <a href="https://noimi.hatenablog.com/entry/2021/05/02/195143">区間を管理する構造体</a>
        の写経モジュールです。区間の追加・削除を追跡しつつ、区間代入と区間削除の操作ができます。
        \(q\) 回操作したとき、挿入・削除される区間の数の合計はたかだか \(5q\) 個 (のはず)
        ですから、区間長を \(n\) として \(O(q \log n)\) でクエリ処理ができます。<br />
      </p>

      <p>
        これを持っているだけで解ける問題もあります。いずれ緑 diff
        の典型データ構造に収束しそうです。<br />
      </p>
      <h3 id="Ix0">
        <a href="#Ix0"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Ix0.html"
            ><code>Ix0</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        これは <code>Graph</code> モジュールのために作った n 次元添字と添字の定義域の抽象です。
        Haskell 標準の
        <a href="https://hackage.haskell.org/package/base-4.21.0.0/docs/Data-Ix.html"
          ><code>Data.Ix</code></a
        >
        は閉区間を前提とするため、わざわざ半開区間・ゼロベースの型クラスを用意したわけですが、賛否両論ありそうです。<br />
      </p>
