src/2025-04-16-ac-library-hs-3.org
** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-KdTree.html][=*KdTree=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ☆ |

\(K\)-d と言いつつ 2 次元限定の静的な \(k\)-d tree です。二次元平面上で、座標軸と平行な辺を持つ矩形範囲内のモノイド積を取得できます。ただし計算量は \(\sqrt n\) らしく (解析は難しそう), 注意が必要です:

| モジュール | 矩形取得 | 最近傍点取得 |
|------------+----------+--------------|
| =LazyKdTree= | o        | -            |
| =KdTree=     | -        | o            |

静的であり、木の構築後に点の追加はできませんが、クエリを先読みして単位元を重みとした点を木の中に入れておくことはできます。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Math.html][=Math=]]

| 出番   | ★ ★ ★ ☆ ☆ |
| 強力さ | ★ ★ ★ ☆ ☆ |

素数判定、素因数分解、約数列挙およびダブリング (binary exponentiation) を収録しています。特に整数関連の関数は、 \(n\) が非常に大きな場合も高速に動作します (計算量は確認中……) 。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Mo.html][=Mo=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ☆ |

区間クエリの平方分割モジュールです。クエリを上手くソートした上で、左右に伸び縮みする尺取り法のように走査すると、 \(O((n + q) \sqrt n)\) でクエリ処理できる魔術的アルゴリズムです。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-ModInt64.html][=ModInt64=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ☆ ☆ ☆ ☆ |

Montgomery 乗算による mod int です。法は奇数とします。まだベンチマークを取っていないので、色々不安です。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Monoid.html][=Monoid=]]

| 出番   | ★ ★ ★ ☆ ☆ |
| 強力さ | ☆ ☆ ☆ ☆ ☆ |

主に遅延セグメント木のための作用モノイドを集めたモジュールです。区間代入、区間加算および非可換モノイドとして代表的な affine 変換があります。作用モノイド以外では rolling hash や affine 変換の対象があります。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-MultiSet.html][=MultiSet=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ☆ ☆ ☆ ☆ |

=HashMap= をラップした multiset です。 =inc= / =dec= が \(O(1)\) で高速ですが、代わりに [[https://judge.yosupo.jp/problem/predecessor_problem][Predecessor Problem]] (1 次元の nearest neighbor problem) が解けません。思いつきで作りましたが、出番は無さそうです。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Pdsu.html][=Pdsu=]]

| 出番   | ★ ★ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ☆ ☆ |

ポテンシャル付き Disjoin Set Union (Union-Find) です。 AtCoder 側も年々典型データ構造の幅を広げており、これを使うだけで解ける問題も幾つかあります。いずれ緑 diff 典型データ構造に収束しそうです。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Pool.html][=Pool=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ☆ ☆ ☆ ☆ ☆ |

内部実装用の pool です。スロットを解放すると、次の =alloc= 時にリサイクルしてくれます。内部実装的には、各エントリを共用体にし、空きスロットで連結リストを作るとメモリ効率が良いですが、横着して解放済みスロットの一覧を持っています。そもそも Haskell で共用体を使うのは上級者感があります。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-SegTree2d.html][=SegTree2d=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ☆ ☆ |

2 次元の静的な正格セグメント木です。簡単そうに聞こえますが、非常に取っつきにくいデータ構造でした。セグメント木の内部配列の添字の関係は \(a_i = a_{2_i} \cdot a_{2_i + 1}\) で、値の更新時にはこれを元に再帰的に配列を更新します。 2 次元添字でも同様に、ただし横方向だけではなく縦方向も更新します。

区間作用は実施できませんが、モノイド積の取得は \(O(\log h \log w)\) (のはず) なので lazy \(k\)-d tree よりも高速です。静的であり、木の作成後に点の追加はできませんが、クエリを先読みして単位元を重みとした点を木の中に入れておくことはできます。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Seq.html][=Seq=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ☆ |

遅延伝播反転可能 splay tree です。内部的には木でありながら、 API としては列であることを強調するため、 =Seq= と命名しました。 Mutable データ構造でありながら [[https://hackage-content.haskell.org/package/containers-0.8/docs/Data-Sequence.html][=Data.Sequence=]] よりも遥かに遅いので、あまりおすすめできません。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Seq-Map.html][=Seq.Map=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ☆ ☆ |

遅延伝播反転可能 splay tree です。 =Seq= をラップして map としての API を実装するため、 =Seq.Map= としました。 Mutable データ構造でありながら [[https://hackage-content.haskell.org/package/containers-0.8/docs/Data-Map.html][=Data.Map=]] よりも遥かに遅いので、あまりおすすめできません。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-SqrtDecomposition.html][=SqrtDecomposition=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ☆ ☆ ☆ |

自分で考えた区間の平方分割のモジュールです。平方分割は、長さ \(n\) の区間を長さ \(\sqrt n\) 程度のブロックに分割し、ブロックごとに集約情報を持つことで \(O(q \sqrt n)\) で区間クエリを処理するアルゴリズムです。

始めは型クラスとしての実装を考えていましたが、ユーザが必要なクエリの種類が 3 種類になる出題があったため、区間幅をブロック単位に分解するだけのモジュールとしました。遅延作用等はユーザ側で処理する必要があります。

別解として平方分割で解ける問題はそこそこありますが、実装量も実行速度も厳しくハズレ解法になりがちな印象です。始めは何でも解けるようになった気がしたものですが……。

