2025-04-16-ac-library-hs-3.html
      <h3 id="*KdTree">
        <a href="#*KdTree"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-KdTree.html"
            ><code>*KdTree</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        \(K\)-d と言いつつ 2 次元限定の静的な \(k\)-d tree
        です。二次元平面上で、座標軸と平行な辺を持つ矩形範囲内のモノイド積を取得できます。ただし計算量は
        \(\sqrt n\) らしく (解析は難しそう), 注意が必要です:<br />
      </p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">モジュール</th>
            <th scope="col" class="org-left">矩形取得</th>
            <th scope="col" class="org-left">最近傍点取得</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left"><code>LazyKdTree</code></td>
            <td class="org-left">o</td>
            <td class="org-left">-</td>
          </tr>

          <tr>
            <td class="org-left"><code>KdTree</code></td>
            <td class="org-left">-</td>
            <td class="org-left">o</td>
          </tr>
        </tbody>
      </table>

      <p>
        静的であり、木の構築後に点の追加はできませんが、クエリを先読みして単位元を重みとした点を木の中に入れておくことはできます。<br />
      </p>
      <h3 id="Math">
        <a href="#Math"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Math.html"
            ><code>Math</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        素数判定、素因数分解、約数列挙およびダブリング (binary exponentiation)
        を収録しています。特に整数関連の関数は、 \(n\) が非常に大きな場合も高速に動作します
        (計算量は確認中……) 。<br />
      </p>
      <h3 id="Mo">
        <a href="#Mo"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Mo.html"
            ><code>Mo</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        区間クエリの平方分割モジュールです。クエリを上手くソートした上で、左右に伸び縮みする尺取り法のような仕組みで走査すると、
        \(O((n + q) \sqrt n)\) でクエリ処理できる魔術的アルゴリズムです。<br />
      </p>
      <h3 id="ModInt64">
        <a href="#ModInt64"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-ModInt64.html"
            ><code>ModInt64</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        Montgomery 乗算による mod int
        です。法は奇数とします。まだベンチマークを取っていないので、色々不安です。<br />
      </p>
      <h3 id="Monoid">
        <a href="#Monoid"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Monoid.html"
            ><code>Monoid</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        主に遅延セグメント木のための作用モノイドを集めたモジュールです。区間代入、区間加算および非可換モノイドとして代表的な
        affine 変換があります。作用モノイド以外では rolling hash や affine 変換の対象があります。<br />
      </p>
      <h3 id="MultiSet">
        <a href="#MultiSet"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-MultiSet.html"
            ><code>MultiSet</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        <code>HashMap</code> をラップした multiset です。 <code>inc</code> / <code>dec</code> が
        \(O(1)\) で高速ですが、代わりに
        <a href="https://judge.yosupo.jp/problem/predecessor_problem">Predecessor Problem</a> (1
        次元の nearest neighbor problem)
        が解けません。思いつきで作りましたが、出番は無さそうです。<br />
      </p>
      <h3 id="Pdsu">
        <a href="#Pdsu"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Pdsu.html"
            ><code>Pdsu</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        ポテンシャル付き Disjoin Set Union (Union-Find) です。 AtCoder
        側も年々典型データ構造の幅を広げており、これを使うだけで解ける問題も幾つかあります。いずれ緑
        diff 典型データ構造に収束しそうです。<br />
      </p>
      <h3 id="Pool">
        <a href="#Pool"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Pool.html"
            ><code>Pool</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        内部実装用の pool です。スロットを解放すると、次の
        <code>alloc</code>
        時にリサイクルしてくれます。内部実装的には、各エントリを共用体にし、空きスロットで連結リストを作るとメモリ効率が良いですが、横着して解放済みスロットの一覧を持っています。そもそも
        Haskell で共用体を使うのは上級者感があります。<br />
      </p>
      <h3 id="SegTree2d">
        <a href="#SegTree2d"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-SegTree2d.html"
            ><code>SegTree2d</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        2
        次元の静的な正格セグメント木です。簡単そうに響きますが、非常に取っつきにくいデータ構造でした。セグメント木の内部配列の添字の関係は
        \(a_i = a_{2_i} \cdot a_{2_i + 1}\) で、値の更新時にはこれを元に再帰的に配列を更新します。 2
        次元添字でも同様に、ただし横方向だけではなく縦方向も更新します。<br />
      </p>

      <p>
        区間作用は実施できませんが、モノイド積の取得は \(O(\log h \log w)\) (のはず) なので lazy
        \(k\)-d tree
        よりも高速です。静的であり、木の作成後に点の追加はできませんが、クエリを先読みして単位元を重みとした点を木の中に入れておくことはできます。<br />
      </p>
      <h3 id="Seq">
        <a href="#Seq"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Seq.html"
            ><code>Seq</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        遅延伝播反転可能 splay tree です。内部的には木でありながら、 API
        としては列であることを強調するため、 <code>Seq</code> と命名しました。 Mutable
        データ構造でありながら
        <a href="https://hackage-content.haskell.org/package/containers-0.8/docs/Data-Sequence.html"
          ><code>Data.Sequence</code></a
        >
        よりも遥かに遅いので、あまりおすすめできません。<br />
      </p>
      <h3 id="Seq.Map">
        <a href="#Seq.Map"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Seq-Map.html"
            ><code>Seq.Map</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        遅延伝播反転可能 splay tree です。 <code>Seq</code> をラップして map としての API
        を実装するため、 <code>Map.Seq</code> としました。 Mutable データ構造でありながら
        <a href="https://hackage-content.haskell.org/package/containers-0.8/docs/Data-Map.html"
          ><code>Data.Map</code></a
        >
        よりも遥かに遅いので、あまりおすすめできません。<br />
      </p>
      <h3 id="SqrtDecomposition">
        <a href="#SqrtDecomposition"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-SqrtDecomposition.html"
            ><code>SqrtDecomposition</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        自分で考えた区間の平方分割のモジュールです。平方分割は、長さ \(n\) の区間を長さ \(\sqrt n\)
        程度ののブロックに分割し、ブロックごとに集約情報を持つことで \(O(q \sqrt n)\)
        程度で区間クエリを処理するアルゴリズムです。<br />
      </p>

      <p>
        始めは型クラスとしての実装を考えていましたが、ユーザが必要なクエリの種類が 3
        種類になる問題があったため、区間幅をブロック単位に分解するだけのモジュールとしました。遅延作用等はユーザ側で処理する必要があります。<br />
      </p>

      <p>
        別解として平方分割で解ける問題はそこそこありますが、実装量も実行速度も厳しくハズレ解法になりがちな印象です。始めは何でも解けるようになった気がしたものですが……。<br />
      </p>
