src/2025-04-16-ac-library-hs-3.org
** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree.html][=Tree=]]

| 出番   | ★ ★ ☆ ☆ ☆ |
| 強力さ | ★ ★ ☆ ☆ ☆ |

木のモジュールです。木の直径、畳み込み、全方位木 DP (=foldReroot=) を収録しています。全方位木 DP で解ける問題は結構出ていて、そろそろ緑 diff になる気がしてます。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-Hld.html][=Tree.Hld=]], [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-TreeMonoid.html][=Tree.TreeMonoid=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ☆ |

Heavy-light decomposition と、その上にセグメント木を載せたモジュールです。木をブロックに分け、頂点番号を振り直すと、頂点 (または辺) がセグメント木に載り、経路のモノイド積を \(O(\log^2 n)\) で取得できます。 LCA の取得や部分木の畳み込みもできます。

セグメント木と比べて Fenwick Tree (binary indexed tree) がかなり速いので、そちらにも対応すべきかもしれません (maspy さんのライブラリでは対応しています) 。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-Lct.html][=Tree.Lct=]]

| 出番   | ☆ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ★ ★ ★ |

弱い link/cut tree (のはず) です。辺の追加・削除ができる =TreeMonoid= といった趣で、とにかく強力です。部分木への作用ができると強い LCT (top tree?) になる気がします。この辺り、一部では常識のように謳われていますが、僕はついて行けません。

** [[https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-WaveletMatrix.html][=WaveletMatrix*=]]

| 出番   | ★ ☆ ☆ ☆ ☆ |
| 強力さ | ★ ★ ☆ ☆ ☆ |

僕が作った wavelet matrix です。 maspy さんの wavelet matrix は 1 次元版でもモノイド積を取れるので、写経しておけば良かった痛恨のモジュールです。しかし早めに至らなさを実感できたおかげで、他のモジュールでは写経に徹することができました。

以上、主に写経で作ったモジュール達ですが、僕自身が完全に理解するには追加で半年必要かもしれません。人生が、人生が終わってしまう……

* まとめ

=ac-library-hs= の =Extra= モジュールを作成しました。 Haskell では貴重な mutable データ構造を追加した他、 AtCoder Library には無いものの定番のデータ構造と、アルゴリズム実技検定などで稀に使えそうな強力なコードを追加できました。

この半年はひたすら =ac-library-hs= を作っていました。正直ユーザは僕だけになる可能性が高いですが、一応誰でも使えるライブラリを用意できたのは役得でした。早くオンラインジャッジで =import AtCoder.XXX= を書いてみたいです。とにかく楽しみです。

