2025-04-16-ac-library-hs-3.html
      <h3 id="Tree">
        <a href="#Tree"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree.html"
            ><code>Tree</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        木のモジュールです。木の直径、畳み込み、全方位木 DP (<code>foldReroot</code>)
        を収録しています。全方位木 DP で解ける問題は結構出ていて、そろそろ緑 diff
        になる気がしてます。<br />
      </p>
      <h3 id="Tree.Hld, Tree.TreeMonoid">
        <a href="#Tree.Hld, Tree.TreeMonoid"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-Hld.html"
            ><code>Tree.Hld</code></a
          >,
          <a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-TreeMonoid.html"
            ><code>Tree.TreeMonoid</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        Heavy-light decomposition
        と、その上にセグメント木を載せたモジュールです。木をブロックに分け、頂点番号を振り直すと、頂点
        (または辺) がセグメント木に載り、経路のモノイド積を \(O(\log^2 n)\) で取得できます。 LCA
        の取得や部分木の畳み込みも可能です。<br />
      </p>

      <p>
        セグメント木と比べて Fenwick Tree (binary indexed tree)
        がかなり速いので、そちらにも対応すべきかもしれません (maspy
        さんのライブラリでは対応しています) 。<br />
      </p>
      <h3 id="Tree.Lct">
        <a href="#Tree.Lct"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-Tree-Lct.html"
            ><code>Tree.Lct</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">☆ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ★ ★ ★</td>
          </tr>
        </tbody>
      </table>

      <p>
        弱い link/cut tree (のはず) です。辺の追加・削除ができる
        <code>TreeMonoid</code> といった趣で、とにかく強力です。部分木への作用ができると強い LCT
        (top tree?)
        になる気がします。この辺り、一部では常識のように謳われていますが、僕はついて行けません。<br />
      </p>
      <h3 id="WaveletMatrix*">
        <a href="#WaveletMatrix*"
          ><a
            href="https://hackage-content.haskell.org/package/ac-library-hs/docs/AtCoder-Extra-WaveletMatrix.html"
            ><code>WaveletMatrix*</code></a
          ></a
        >
      </h3>
      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <tbody>
          <tr>
            <td class="org-left">出番</td>
            <td class="org-left">★ ☆ ☆ ☆ ☆</td>
          </tr>

          <tr>
            <td class="org-left">強力さ</td>
            <td class="org-left">★ ★ ☆ ☆ ☆</td>
          </tr>
        </tbody>
      </table>

      <p>
        僕が作った wavelet matrix です。 maspy さんの wavelet matrix は 1
        次元版でもモノイド積を取れるので、写経しておけば良かった痛恨のモジュールです。しかし早めに至らなさを実感できたおかげで、他のモジュールでは写経に徹することができました。<br />
      </p>

      <p>
        以上、主に写経で作ったモジュール達ですが、僕自身が完全に理解するには追加で半年必要かもしれません。人生が、人生が終わってしまう……<br />
      </p>
      <h2 id="まとめ"><a href="#まとめ">まとめ</a></h2>
      <p>
        <code>ac-library-hs</code> の <code>Extra</code> モジュールを作成しました。 Haskell
        では貴重な mutable データ構造を追加した他、 AtCoder Library
        には無いものの定番のデータ構造と、アルゴリズム実技検定などで稀に使えそうな強力なコードを追加できました。<br />
      </p>

      <p>
        この半年はひたすら
        <code>ac-library-hs</code>
        を作っていました。正直ユーザは僕だけになる可能性が高いですが、一応誰でも使えるライブラリを用意できたのは役得でした。早くオンラインジャッジで
        <code>import AtCoder.XXX</code> を書いてみたいです。とにかく楽しみです。<br />
      </p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
